tutorials/lagrangian/reactingParticleFoam/filter/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

filter1
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        filter;

        type            DarcyForchheimer;

        d   (500000 -1000 -1000);
        f   (0 0 0);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            coordinateRotation
            {
                type    axesRotation;
                e1  (1 0 0);
                e2  (0 1 0);
            }
        }
    }
}


massSource
{
    type            semiImplicitSource;

    timeStart       0.2;
    duration        2.0;
    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    volumeMode      absolute;

    sources
    {
        rho
        {
            explicit    1e-4; // kg/s
            implicit    0;
        }

        U
        {
            explicit    (0 0.005 0);
            implicit    0;
        }

        h
        {
            explicit    10;
            implicit    0;
        }

        H2O
        {
            explicit    1e-4; // kg/s
            implicit    0;
        }
    }
}


// ************************************************************************* //
